app/controllers/api/v1/plans_controller.rb

      def index
        @plans = Plan.order('created_at DESC');
---
SELECT "plans".* FROM "plans" ORDER BY created_at DESC

      def show
        @plan = Plan.find(params[:id])
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]