app/controllers/phones_controller.rb

  def index
    @phones = Phone.all
---
SELECT "phones".* FROM "phones"